package me.xmpl.airdrop.model;

public enum AirDropStage {
    IDLE,               // Отсчет 1 часа до спавна (с предупреждением за 5 минут)
    WAITING_ACTIVATION, // Сундук стоит и ждет клика ПКМ (до 10 минут)
    UNLOCKING,          // Идет 60 секунд до первого открытия
    DROPPING,           // Крышка открыта, предметы вылетают вверх и в стороны
    RELOADING,          // Крышка закрыта, 60 секунд перезарядки между фазами
    FINISHED            // Все фазы выданы, сундук стоит последние 5 минут до исчезновения
}